app/views/posts/new.html.erb

SELECT "categories".* FROM "categories"
SELECT 1 AS one FROM "categories" INNER JOIN "post_categories" ON "categories"."id" = "post_categories"."category_id" WHERE "post_categories"."post_id" IS NULL AND "categories"."id" = 1 LIMIT 1
---
	<% @categories.each do |c| %>
		<p><%= check_box_tag 'post[category_ids][]', c.id, @post.categories.include?(c) %>